{
  "recipes": [
    {
      "id": "52802",
      "name": "Fish pie",
      "image": "https://www.themealdb.com/images/media/meals/ysxwuq1487323065.jpg",
      "category": "Seafood",
      "is_favorite": false,
      "instructions": [
        "01.Put the potatoes in a large pan of cold salted water and bring to the boil. Lower the heat, cover, then simmer gently for 15 minutes until tender. Drain, then return to the pan over a low heat for 30 seconds to drive off any excess water. Mash with 1 tbsp olive oil, then season.",
        "02.Meanwhile put the milk in a large sauté pan, add the fish and bring to the boil. Remove from the heat, cover and stand for 3 minutes. Remove the fish (reserving the milk) and pat dry with kitchen paper, then gently flake into an ovenproof dish, discarding the skin and any bones.",
        "03.Heat the remaining oil in a pan, stir in the flour and cook for 30 seconds. Gradually stir in 200-250ml of the reserved milk (discard the rest). Grate in nutmeg, season, then bubble until thick. Stir in the cream.",
        "04.Preheat the oven to 190°C/fan170°C/gas 5. Grate the artichokes and add to the dish with the leek, prawns and herbs. Stir the lemon zest and juice into the sauce, then pour over. Mix gently with a wooden spoon.",
        "05.Spoon the mash onto the fish mixture, then use a fork to make peaks, which will crisp and brown as it cooks. Sprinkle over the cheese, then bake for 35-40 minutes until golden and bubbling. Serve with wilted greens."
      ],
      "ingredients": [
        "900g Floury Potatoes",
        "2 tbsp Olive Oil",
        "600ml Semi-skimmed Milk",
        "800g White Fish Fillets",
        "1 tbsp Plain flour",
        "Grating Nutmeg",
        "3 tbsp Double Cream",
        "200g Jerusalem Artichokes",
        "1 finely sliced Leek",
        "200g peeled raw Prawns",
        "Large handful Parsley",
        "Handful Dill",
        "Grated zest of 1 Lemon",
        "25g grated Gruyère",
        "Juice of 1 Lemon"
      ]
    },
    {
      "id": "52817",
      "name": "Stovetop Eggplant With Harissa, Chickpeas, and Cumin Yogurt",
      "image": "https://www.themealdb.com/images/media/meals/yqwtvu1487426027.jpg",
      "category": "Vegetarian",
      "is_favorite": false,
      "instructions": [
        "Heat the oil in a 12-inch skillet over high heat until shimmering. Add the eggplants and lower the heat to medium. Season with salt and pepper as you rotate the eggplants, browning them on all sides. Continue to cook, turning regularly, until a fork inserted into the eggplant meets no resistance (you may have to stand them up on their fat end to finish cooking the thickest parts), about 20 minutes, lowering the heat and sprinkling water into the pan as necessary if the eggplants threaten to burn or smoke excessively.",
        "",
        "2.",
        "Mix the harissa, chickpeas and tomatoes together, then add to the eggplants. Cook until the tomatoes have blistered and broken down, about 5 minutes more. Season with salt and pepper and add water as necessary to thin to a saucy consistency. Meanwhile, combine the yogurt and cumin in a serving bowl. Season with salt and pepper.",
        "",
        "3.",
        "Top the eggplant mixture with the parsley, drizzle with more extra virgin olive oil, and serve with the yogurt on the side."
      ],
      "ingredients": [
        "4 tablespoons Olive Oil",
        "6 small Egg Plants",
        "½ tablespoon Harissa",
        "1 can Chickpeas",
        "2 cups halved Cherry Tomatoes",
        "1 1/2 cups Greek yogurt",
        "1 tablespoon Ground cumin",
        "½ cup  Parsley"
      ]
    },
    {
      "id": "52962",
      "name": "Salmon Eggs Eggs Benedict",
      "image": "https://www.themealdb.com/images/media/meals/1550440197.jpg",
      "category": "Breakfast",
      "is_favorite": false,
      "instructions": [
        "First make the Hollandaise sauce. Put the lemon juice and vinegar in a small bowl, add the egg yolks and whisk with a balloon whisk until light and frothy. Place the bowl over a pan of simmering water and whisk until mixture thickens. Gradually add the butter, whisking constantly until thick – if it looks like it might be splitting, then whisk off the heat for a few mins. Season and keep warm.",
        "",
        "To poach the eggs, bring a large pan of water to the boil and add the vinegar. Lower the heat so that the water is simmering gently. Stir the water so you have a slight whirlpool, then slide in the eggs one by one. Cook each for about 4 mins, then remove with a slotted spoon.",
        "",
        "Lightly toast and butter the muffins, then put a couple of slices of salmon on each half. Top each with an egg, spoon over some Hollandaise and garnish with chopped chives."
      ],
      "ingredients": [
        "4 Eggs",
        "2 tbs White Wine Vinegar",
        "2 English Muffins",
        "To serve Butter",
        "8 slices Smoked Salmon",
        "2 tsp Lemon Juice",
        "2 tsp White Wine Vinegar",
        "3 Yolkes Egg",
        "125g Unsalted Butter"
      ]
    },
    {
      "id": "52999",
      "name": "Crispy Sausages and Greens",
      "image": "https://www.themealdb.com/images/media/meals/st1ifa1583267248.jpg",
      "category": "Pork",
      "is_favorite": false,
      "instructions": [
        "Preheat the oven to 350°. Remove the stems from one bunch of Tuscan kale and tear the leaves into 1\" pieces (mustard greens, collards, spinach, and chard are great, too). Coarsely chop half a head of green cabbage. Combine the greens in a large baking dish and add 4 cloves of thinly sliced garlic. Adding some sliced onions and shiitake mushrooms at this point is optional, but highly recommended (I'll sauté the onions and mushrooms in a cast iron baking dish right on the stove before adding to the greens). Coat the greens with some olive oil and pour ½ cup chicken stock or broth over everything. Cover the dish with foil and bake until the greens are wilted, about 15 minutes. Remove foil and season with salt and pepper. Continue to bake until cabbage is tender, about 20-25 minutes more.",
        "",
        "Meanwhile, heat a little olive oil in a large skillet over medium-high. Prick four sweet Italian sausages with a fork and cook until browned on all sides and cooked through, 10 to 12 minutes. When the greens are done, slice the sausage and toss into the greens with a splash of your favorite vinegar (I like sherry or red wine)."
      ],
      "ingredients": [
        "1  bunch Kale",
        "8 Italian Fennel Sausages",
        "1 Head chopped Cabbage",
        "8 Garlic Clove",
        "Sliced Onion",
        "Sliced Shiitake Mushrooms",
        "1 cup  Chicken Stock",
        "  Salt",
        "  Pepper"
      ]
    }
  ]
}